Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/dma.h
/* -------- DMA_CHINTF : (DMA Offset: 0x14) (R/W 32) CHANNEL INTERRUPT FLAG REGISTER -------- */
#define DMA_CHINTF_RESETVALUE                 _UINT32_(0x00)                                       /*  (DMA_CHINTF) CHANNEL INTERRUPT FLAG REGISTER  Reset Value */

#define DMA_CHINTF_SD_Pos                     _UINT32_(0)                                          /* (DMA_CHINTF) Start Detected Interrupt Flag (0: none ; 1: Start Detected) Position */
#define DMA_CHINTF_SD_Msk                     (_UINT32_(0x1) << DMA_CHINTF_SD_Pos)                 /* (DMA_CHINTF) Start Detected Interrupt Flag (0: none ; 1: Start Detected) Mask */
#define DMA_CHINTF_SD(value)                  (DMA_CHINTF_SD_Msk & (_UINT32_(value) << DMA_CHINTF_SD_Pos)) /* Assigment of value for SD in the DMA_CHINTF register */
#define DMA_CHINTF_TA_Pos                     _UINT32_(1)                                          /* (DMA_CHINTF) Transfer Abort Interrupt Flag (0: none; 1: Transfer Aborted) Position */
#define DMA_CHINTF_TA_Msk                     (_UINT32_(0x1) << DMA_CHINTF_TA_Pos)                 /* (DMA_CHINTF) Transfer Abort Interrupt Flag (0: none; 1: Transfer Aborted) Mask */
#define DMA_CHINTF_TA(value)                  (DMA_CHINTF_TA_Msk & (_UINT32_(value) << DMA_CHINTF_TA_Pos)) /* Assigment of value for TA in the DMA_CHINTF register */
#define DMA_CHINTF_CC_Pos                     _UINT32_(2)                                          /* (DMA_CHINTF) Cell Transfer Complete Interrupt Flag (0: none ; 1: complete) Position */
#define DMA_CHINTF_CC_Msk                     (_UINT32_(0x1) << DMA_CHINTF_CC_Pos)                 /* (DMA_CHINTF) Cell Transfer Complete Interrupt Flag (0: none ; 1: complete) Mask */
#define DMA_CHINTF_CC(value)                  (DMA_CHINTF_CC_Msk & (_UINT32_(value) << DMA_CHINTF_CC_Pos)) /* Assigment of value for CC in the DMA_CHINTF register */
#define DMA_CHINTF_BC_Pos                     _UINT32_(3)                                          /* (DMA_CHINTF) Block Transfer Complete Interrupt Flag (0: none; 1:complete;) Position */
#define DMA_CHINTF_BC_Msk                     (_UINT32_(0x1) << DMA_CHINTF_BC_Pos)                 /* (DMA_CHINTF) Block Transfer Complete Interrupt Flag (0: none; 1:complete;) Mask */
#define DMA_CHINTF_BC(value)                  (DMA_CHINTF_BC_Msk & (_UINT32_(value) << DMA_CHINTF_BC_Pos)) /* Assigment of value for BC in the DMA_CHINTF register */
#define DMA_CHINTF_BH_Pos                     _UINT32_(4)                                          /* (DMA_CHINTF) Block Transfer Half Complete Interrupt Flag (0: none; 1: half complete) Position */
#define DMA_CHINTF_BH_Msk                     (_UINT32_(0x1) << DMA_CHINTF_BH_Pos)                 /* (DMA_CHINTF) Block Transfer Half Complete Interrupt Flag (0: none; 1: half complete) Mask */
#define DMA_CHINTF_BH(value)                  (DMA_CHINTF_BH_Msk & (_UINT32_(value) << DMA_CHINTF_BH_Pos)) /* Assigment of value for BH in the DMA_CHINTF register */
#define DMA_CHINTF_LL_Pos                     _UINT32_(5)                                          /* (DMA_CHINTF) Linked List Done Interrupt Flag (0: none; 1: done) Position */
#define DMA_CHINTF_LL_Msk                     (_UINT32_(0x1) << DMA_CHINTF_LL_Pos)                 /* (DMA_CHINTF) Linked List Done Interrupt Flag (0: none; 1: done) Mask */
#define DMA_CHINTF_LL(value)                  (DMA_CHINTF_LL_Msk & (_UINT32_(value) << DMA_CHINTF_LL_Pos)) /* Assigment of value for LL in the DMA_CHINTF register */
#define DMA_CHINTF_WRE_Pos                    _UINT32_(17)                                         /* (DMA_CHINTF) Write Error Flag (0: none; 1: Write Error) Position */
#define DMA_CHINTF_WRE_Msk                    (_UINT32_(0x1) << DMA_CHINTF_WRE_Pos)                /* (DMA_CHINTF) Write Error Flag (0: none; 1: Write Error) Mask */
#define DMA_CHINTF_WRE(value)                 (DMA_CHINTF_WRE_Msk & (_UINT32_(value) << DMA_CHINTF_WRE_Pos)) /* Assigment of value for WRE in the DMA_CHINTF register */
#define DMA_CHINTF_RDE_Pos                    _UINT32_(18)                                         /* (DMA_CHINTF) Read Error Flag (0: none; 1: Read Error) Position */
#define DMA_CHINTF_RDE_Msk                    (_UINT32_(0x1) << DMA_CHINTF_RDE_Pos)                /* (DMA_CHINTF) Read Error Flag (0: none; 1: Read Error) Mask */
#define DMA_CHINTF_RDE(value)                 (DMA_CHINTF_RDE_Msk & (_UINT32_(value) << DMA_CHINTF_RDE_Pos)) /* Assigment of value for RDE in the DMA_CHINTF register */
#define DMA_CHINTF_Msk                        _UINT32_(0x0006003F)                                 /* (DMA_CHINTF) Register Mask  */


/* -------- DMA_CHSSA : (DMA Offset: 0x18) (R/W 32) CHANNEL SOURCE START ADDRESS -------- */
#define DMA_CHSSA_RESETVALUE                  _UINT32_(0x00)                                       /*  (DMA_CHSSA) CHANNEL SOURCE START ADDRESS  Reset Value */

#define DMA_CHSSA_SSA_Pos                     _UINT32_(0)                                          /* (DMA_CHSSA) Channel Source Start Address Position */
#define DMA_CHSSA_SSA_Msk                     (_UINT32_(0xFFFFFFFF) << DMA_CHSSA_SSA_Pos)          /* (DMA_CHSSA) Channel Source Start Address Mask */
#define DMA_CHSSA_SSA(value)                  (DMA_CHSSA_SSA_Msk & (_UINT32_(value) << DMA_CHSSA_SSA_Pos)) /* Assigment of value for SSA in the DMA_CHSSA register */
#define DMA_CHSSA_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (DMA_CHSSA) Register Mask  */


/* -------- DMA_CHDSA : (DMA Offset: 0x1C) (R/W 32) CHANNEL DESTINATION START ADDRESS -------- */
#define DMA_CHDSA_RESETVALUE                  _UINT32_(0x00)                                       /*  (DMA_CHDSA) CHANNEL DESTINATION START ADDRESS  Reset Value */

#define DMA_CHDSA_DSA_Pos                     _UINT32_(0)                                          /* (DMA_CHDSA) Channel Destination Start Address Position */
#define DMA_CHDSA_DSA_Msk                     (_UINT32_(0xFFFFFFFF) << DMA_CHDSA_DSA_Pos)          /* (DMA_CHDSA) Channel Destination Start Address Mask */
#define DMA_CHDSA_DSA(value)                  (DMA_CHDSA_DSA_Msk & (_UINT32_(value) << DMA_CHDSA_DSA_Pos)) /* Assigment of value for DSA in the DMA_CHDSA register */
#define DMA_CHDSA_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (DMA_CHDSA) Register Mask  */


