Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/dma.h
/* -------- DMA_CHSSTRD : (DMA Offset: 0x20) (R/W 32) CHANNEL SOURCE CELL STRIDE SIZE REGISTER -------- */
#define DMA_CHSSTRD_RESETVALUE                _UINT32_(0x00)                                       /*  (DMA_CHSSTRD) CHANNEL SOURCE CELL STRIDE SIZE REGISTER  Reset Value */

#define DMA_CHSSTRD_SSTRD_Pos                 _UINT32_(0)                                          /* (DMA_CHSSTRD) Source Cell Stride Size Position */
#define DMA_CHSSTRD_SSTRD_Msk                 (_UINT32_(0xFFFF) << DMA_CHSSTRD_SSTRD_Pos)          /* (DMA_CHSSTRD) Source Cell Stride Size Mask */
#define DMA_CHSSTRD_SSTRD(value)              (DMA_CHSSTRD_SSTRD_Msk & (_UINT32_(value) << DMA_CHSSTRD_SSTRD_Pos)) /* Assigment of value for SSTRD in the DMA_CHSSTRD register */
#define DMA_CHSSTRD_Msk                       _UINT32_(0x0000FFFF)                                 /* (DMA_CHSSTRD) Register Mask  */


/* -------- DMA_CHDSTRD : (DMA Offset: 0x24) (R/W 32) CHANNEL DESTINATION CELL STRIDE SIZE REGISTER -------- */
#define DMA_CHDSTRD_RESETVALUE                _UINT32_(0x00)                                       /*  (DMA_CHDSTRD) CHANNEL DESTINATION CELL STRIDE SIZE REGISTER  Reset Value */

#define DMA_CHDSTRD_DSTRD_Pos                 _UINT32_(0)                                          /* (DMA_CHDSTRD) Destination Cell Stride Size Position */
#define DMA_CHDSTRD_DSTRD_Msk                 (_UINT32_(0xFFFF) << DMA_CHDSTRD_DSTRD_Pos)          /* (DMA_CHDSTRD) Destination Cell Stride Size Mask */
#define DMA_CHDSTRD_DSTRD(value)              (DMA_CHDSTRD_DSTRD_Msk & (_UINT32_(value) << DMA_CHDSTRD_DSTRD_Pos)) /* Assigment of value for DSTRD in the DMA_CHDSTRD register */
#define DMA_CHDSTRD_Msk                       _UINT32_(0x0000FFFF)                                 /* (DMA_CHDSTRD) Register Mask  */


/* -------- DMA_CHXSIZ : (DMA Offset: 0x28) (R/W 32) CHANNEL TRANSFER SIZE REGISTER -------- */
#define DMA_CHXSIZ_RESETVALUE                 _UINT32_(0x00)                                       /*  (DMA_CHXSIZ) CHANNEL TRANSFER SIZE REGISTER  Reset Value */

#define DMA_CHXSIZ_CSZ_Pos                    _UINT32_(0)                                          /* (DMA_CHXSIZ) Cell transfer size in bytes. Position */
#define DMA_CHXSIZ_CSZ_Msk                    (_UINT32_(0x3FF) << DMA_CHXSIZ_CSZ_Pos)              /* (DMA_CHXSIZ) Cell transfer size in bytes. Mask */
#define DMA_CHXSIZ_CSZ(value)                 (DMA_CHXSIZ_CSZ_Msk & (_UINT32_(value) << DMA_CHXSIZ_CSZ_Pos)) /* Assigment of value for CSZ in the DMA_CHXSIZ register */
#define DMA_CHXSIZ_BLKSZ_Pos                  _UINT32_(16)                                         /* (DMA_CHXSIZ) Block transfer size in bytes. Position */
#define DMA_CHXSIZ_BLKSZ_Msk                  (_UINT32_(0xFFFF) << DMA_CHXSIZ_BLKSZ_Pos)           /* (DMA_CHXSIZ) Block transfer size in bytes. Mask */
#define DMA_CHXSIZ_BLKSZ(value)               (DMA_CHXSIZ_BLKSZ_Msk & (_UINT32_(value) << DMA_CHXSIZ_BLKSZ_Pos)) /* Assigment of value for BLKSZ in the DMA_CHXSIZ register */
#define DMA_CHXSIZ_Msk                        _UINT32_(0xFFFF03FF)                                 /* (DMA_CHXSIZ) Register Mask  */


/* -------- DMA_CHPDAT : (DMA Offset: 0x2C) (R/W 32) CHANNEL PATTERN MATCH DATA -------- */
#define DMA_CHPDAT_RESETVALUE                 _UINT32_(0x00)                                       /*  (DMA_CHPDAT) CHANNEL PATTERN MATCH DATA  Reset Value */

#define DMA_CHPDAT_PDAT_Pos                   _UINT32_(0)                                          /* (DMA_CHPDAT) Channel Pattern Match Data Position */
#define DMA_CHPDAT_PDAT_Msk                   (_UINT32_(0xFFFF) << DMA_CHPDAT_PDAT_Pos)            /* (DMA_CHPDAT) Channel Pattern Match Data Mask */
#define DMA_CHPDAT_PDAT(value)                (DMA_CHPDAT_PDAT_Msk & (_UINT32_(value) << DMA_CHPDAT_PDAT_Pos)) /* Assigment of value for PDAT in the DMA_CHPDAT register */
#define DMA_CHPDAT_PIGN_Pos                   _UINT32_(24)                                         /* (DMA_CHPDAT) Channel Pattern Ignore Value Position */
#define DMA_CHPDAT_PIGN_Msk                   (_UINT32_(0xFF) << DMA_CHPDAT_PIGN_Pos)              /* (DMA_CHPDAT) Channel Pattern Ignore Value Mask */
#define DMA_CHPDAT_PIGN(value)                (DMA_CHPDAT_PIGN_Msk & (_UINT32_(value) << DMA_CHPDAT_PIGN_Pos)) /* Assigment of value for PIGN in the DMA_CHPDAT register */
#define DMA_CHPDAT_Msk                        _UINT32_(0xFF00FFFF)                                 /* (DMA_CHPDAT) Register Mask  */


/* -------- DMA_CHCTRLCRC : (DMA Offset: 0x30) (R/W 32) CHANNEL CONTROL CRC -------- */
#define DMA_CHCTRLCRC_RESETVALUE              _UINT32_(0x00)                                       /*  (DMA_CHCTRLCRC) CHANNEL CONTROL CRC  Reset Value */

#define DMA_CHCTRLCRC_CRCMD_Pos               _UINT32_(0)                                          /* (DMA_CHCTRLCRC) CRC/Checksum Mode Position */
#define DMA_CHCTRLCRC_CRCMD_Msk               (_UINT32_(0x7) << DMA_CHCTRLCRC_CRCMD_Pos)           /* (DMA_CHCTRLCRC) CRC/Checksum Mode Mask */
#define DMA_CHCTRLCRC_CRCMD(value)            (DMA_CHCTRLCRC_CRCMD_Msk & (_UINT32_(value) << DMA_CHCTRLCRC_CRCMD_Pos)) /* Assigment of value for CRCMD in the DMA_CHCTRLCRC register */
#define   DMA_CHCTRLCRC_CRCMD_CRC_16_Val      _UINT32_(0x0)                                        /* (DMA_CHCTRLCRC) Normal (0x8005) CRC-16/CRC-16-IBM/CRC-16-ANSI  */
#define   DMA_CHCTRLCRC_CRCMD_CRC_16_CCITT_Val _UINT32_(0x1)                                        /* (DMA_CHCTRLCRC) Normal (0x1021) CRC-16-CCITT  */
#define   DMA_CHCTRLCRC_CRCMD_16_BIT_CRCPOLYA_Val _UINT32_(0x2)                                        /* (DMA_CHCTRLCRC) CRC-16 based on polynomial provided in CRCPOLYA (POLYA[15:0]) register  */
#define   DMA_CHCTRLCRC_CRCMD_16_BIT_CRCPOLYB_Val _UINT32_(0x3)                                        /* (DMA_CHCTRLCRC) CRC-16 based on polynomial provided in CRCPOLYB (POLYB[15:0]) register  */
#define   DMA_CHCTRLCRC_CRCMD_CRC_32_Val      _UINT32_(0x4)                                        /* (DMA_CHCTRLCRC) Normal (0x04C11DB7) CRC-32  */
#define   DMA_CHCTRLCRC_CRCMD_32_BIT_CRCPOLYA_Val _UINT32_(0x5)                                        /* (DMA_CHCTRLCRC) CRC-32 based on polynomial provided in CRCPOLYA register  */
#define   DMA_CHCTRLCRC_CRCMD_32_BIT_CRCPOLYB_Val _UINT32_(0x6)                                        /* (DMA_CHCTRLCRC) CRC-32 based on polynomial provided in CRCPOLYB register  */
#define   DMA_CHCTRLCRC_CRCMD_IP_HDR_CHECKSUM_Val _UINT32_(0x7)                                        /* (DMA_CHCTRLCRC) Calculate IP header checksum  */
#define DMA_CHCTRLCRC_CRCMD_CRC_16            (DMA_CHCTRLCRC_CRCMD_CRC_16_Val << DMA_CHCTRLCRC_CRCMD_Pos) /* (DMA_CHCTRLCRC) Normal (0x8005) CRC-16/CRC-16-IBM/CRC-16-ANSI Position  */
#define DMA_CHCTRLCRC_CRCMD_CRC_16_CCITT      (DMA_CHCTRLCRC_CRCMD_CRC_16_CCITT_Val << DMA_CHCTRLCRC_CRCMD_Pos) /* (DMA_CHCTRLCRC) Normal (0x1021) CRC-16-CCITT Position  */
#define DMA_CHCTRLCRC_CRCMD_16_BIT_CRCPOLYA   (DMA_CHCTRLCRC_CRCMD_16_BIT_CRCPOLYA_Val << DMA_CHCTRLCRC_CRCMD_Pos) /* (DMA_CHCTRLCRC) CRC-16 based on polynomial provided in CRCPOLYA (POLYA[15:0]) register Position  */
#define DMA_CHCTRLCRC_CRCMD_16_BIT_CRCPOLYB   (DMA_CHCTRLCRC_CRCMD_16_BIT_CRCPOLYB_Val << DMA_CHCTRLCRC_CRCMD_Pos) /* (DMA_CHCTRLCRC) CRC-16 based on polynomial provided in CRCPOLYB (POLYB[15:0]) register Position  */
#define DMA_CHCTRLCRC_CRCMD_CRC_32            (DMA_CHCTRLCRC_CRCMD_CRC_32_Val << DMA_CHCTRLCRC_CRCMD_Pos) /* (DMA_CHCTRLCRC) Normal (0x04C11DB7) CRC-32 Position  */
#define DMA_CHCTRLCRC_CRCMD_32_BIT_CRCPOLYA   (DMA_CHCTRLCRC_CRCMD_32_BIT_CRCPOLYA_Val << DMA_CHCTRLCRC_CRCMD_Pos) /* (DMA_CHCTRLCRC) CRC-32 based on polynomial provided in CRCPOLYA register Position  */
#define DMA_CHCTRLCRC_CRCMD_32_BIT_CRCPOLYB   (DMA_CHCTRLCRC_CRCMD_32_BIT_CRCPOLYB_Val << DMA_CHCTRLCRC_CRCMD_Pos) /* (DMA_CHCTRLCRC) CRC-32 based on polynomial provided in CRCPOLYB register Position  */
#define DMA_CHCTRLCRC_CRCMD_IP_HDR_CHECKSUM   (DMA_CHCTRLCRC_CRCMD_IP_HDR_CHECKSUM_Val << DMA_CHCTRLCRC_CRCMD_Pos) /* (DMA_CHCTRLCRC) Calculate IP header checksum Position  */
#define DMA_CHCTRLCRC_CRCAPP_Pos              _UINT32_(3)                                          /* (DMA_CHCTRLCRC) CRC Append Mode Position */
#define DMA_CHCTRLCRC_CRCAPP_Msk              (_UINT32_(0x1) << DMA_CHCTRLCRC_CRCAPP_Pos)          /* (DMA_CHCTRLCRC) CRC Append Mode Mask */
#define DMA_CHCTRLCRC_CRCAPP(value)           (DMA_CHCTRLCRC_CRCAPP_Msk & (_UINT32_(value) << DMA_CHCTRLCRC_CRCAPP_Pos)) /* Assigment of value for CRCAPP in the DMA_CHCTRLCRC register */
#define DMA_CHCTRLCRC_CRCXOR_Pos              _UINT32_(5)                                          /* (DMA_CHCTRLCRC) CRC XOR Mode Position */
#define DMA_CHCTRLCRC_CRCXOR_Msk              (_UINT32_(0x1) << DMA_CHCTRLCRC_CRCXOR_Pos)          /* (DMA_CHCTRLCRC) CRC XOR Mode Mask */
#define DMA_CHCTRLCRC_CRCXOR(value)           (DMA_CHCTRLCRC_CRCXOR_Msk & (_UINT32_(value) << DMA_CHCTRLCRC_CRCXOR_Pos)) /* Assigment of value for CRCXOR in the DMA_CHCTRLCRC register */
#define DMA_CHCTRLCRC_CRCROUT_Pos             _UINT32_(6)                                          /* (DMA_CHCTRLCRC) CRC Reflected Output Mode Position */
#define DMA_CHCTRLCRC_CRCROUT_Msk             (_UINT32_(0x1) << DMA_CHCTRLCRC_CRCROUT_Pos)         /* (DMA_CHCTRLCRC) CRC Reflected Output Mode Mask */
#define DMA_CHCTRLCRC_CRCROUT(value)          (DMA_CHCTRLCRC_CRCROUT_Msk & (_UINT32_(value) << DMA_CHCTRLCRC_CRCROUT_Pos)) /* Assigment of value for CRCROUT in the DMA_CHCTRLCRC register */
#define DMA_CHCTRLCRC_CRCRIN_Pos              _UINT32_(7)                                          /* (DMA_CHCTRLCRC) CRC Reflect Input Selection Position */
#define DMA_CHCTRLCRC_CRCRIN_Msk              (_UINT32_(0x1) << DMA_CHCTRLCRC_CRCRIN_Pos)          /* (DMA_CHCTRLCRC) CRC Reflect Input Selection Mask */
#define DMA_CHCTRLCRC_CRCRIN(value)           (DMA_CHCTRLCRC_CRCRIN_Msk & (_UINT32_(value) << DMA_CHCTRLCRC_CRCRIN_Pos)) /* Assigment of value for CRCRIN in the DMA_CHCTRLCRC register */
#define DMA_CHCTRLCRC_Msk                     _UINT32_(0x000000EF)                                 /* (DMA_CHCTRLCRC) Register Mask  */


/* -------- DMA_CHCRCDAT : (DMA Offset: 0x34) (R/W 32) CHANNEL CRC/CHECKSUM DATA REGISTER -------- */
#define DMA_CHCRCDAT_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_CHCRCDAT) CHANNEL CRC/CHECKSUM DATA REGISTER  Reset Value */

#define DMA_CHCRCDAT_CRCDAT_Pos               _UINT32_(0)                                          /* (DMA_CHCRCDAT) CRC Data Position */
#define DMA_CHCRCDAT_CRCDAT_Msk               (_UINT32_(0xFFFFFFFF) << DMA_CHCRCDAT_CRCDAT_Pos)    /* (DMA_CHCRCDAT) CRC Data Mask */
#define DMA_CHCRCDAT_CRCDAT(value)            (DMA_CHCRCDAT_CRCDAT_Msk & (_UINT32_(value) << DMA_CHCRCDAT_CRCDAT_Pos)) /* Assigment of value for CRCDAT in the DMA_CHCRCDAT register */
#define DMA_CHCRCDAT_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (DMA_CHCRCDAT) Register Mask  */


/* -------- DMA_CHNXT : (DMA Offset: 0x38) (R/W 32) CHANNEL NEXT DESCRIPTOR ADDRESS POINTER -------- */
#define DMA_CHNXT_RESETVALUE                  _UINT32_(0x00)                                       /*  (DMA_CHNXT) CHANNEL NEXT DESCRIPTOR ADDRESS POINTER  Reset Value */

