Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/dma.h
#define DMA_CHNXT_NXT_Pos                     _UINT32_(0)                                          /* (DMA_CHNXT) Channel Address Pointer to Next Descriptor Position */
#define DMA_CHNXT_NXT_Msk                     (_UINT32_(0xFFFFFFFF) << DMA_CHNXT_NXT_Pos)          /* (DMA_CHNXT) Channel Address Pointer to Next Descriptor Mask */
#define DMA_CHNXT_NXT(value)                  (DMA_CHNXT_NXT_Msk & (_UINT32_(value) << DMA_CHNXT_NXT_Pos)) /* Assigment of value for NXT in the DMA_CHNXT register */
#define DMA_CHNXT_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (DMA_CHNXT) Register Mask  */


/* -------- DMA_CHLLCFGSTAT : (DMA Offset: 0x3C) ( R/ 32) CHANNEL LINKED LIST CONFIGURATION STATUS REGISTER -------- */
#define DMA_CHLLCFGSTAT_RESETVALUE            _UINT32_(0x00)                                       /*  (DMA_CHLLCFGSTAT) CHANNEL LINKED LIST CONFIGURATION STATUS REGISTER  Reset Value */

#define DMA_CHLLCFGSTAT_CTRLB_Pos             _UINT32_(0)                                          /* (DMA_CHLLCFGSTAT) CTRLB Register Descriptor Load Position */
#define DMA_CHLLCFGSTAT_CTRLB_Msk             (_UINT32_(0x1) << DMA_CHLLCFGSTAT_CTRLB_Pos)         /* (DMA_CHLLCFGSTAT) CTRLB Register Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_CTRLB(value)          (DMA_CHLLCFGSTAT_CTRLB_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_CTRLB_Pos)) /* Assigment of value for CTRLB in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_EVCTRL_Pos            _UINT32_(1)                                          /* (DMA_CHLLCFGSTAT) EVCTRL Register Descriptor Load Position */
#define DMA_CHLLCFGSTAT_EVCTRL_Msk            (_UINT32_(0x1) << DMA_CHLLCFGSTAT_EVCTRL_Pos)        /* (DMA_CHLLCFGSTAT) EVCTRL Register Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_EVCTRL(value)         (DMA_CHLLCFGSTAT_EVCTRL_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_EVCTRL_Pos)) /* Assigment of value for EVCTRL in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_SSA_Pos               _UINT32_(2)                                          /* (DMA_CHLLCFGSTAT) Source Start Address Descriptor Load Position */
#define DMA_CHLLCFGSTAT_SSA_Msk               (_UINT32_(0x1) << DMA_CHLLCFGSTAT_SSA_Pos)           /* (DMA_CHLLCFGSTAT) Source Start Address Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_SSA(value)            (DMA_CHLLCFGSTAT_SSA_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_SSA_Pos)) /* Assigment of value for SSA in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_DSA_Pos               _UINT32_(3)                                          /* (DMA_CHLLCFGSTAT) Destination Start Address Descriptor Load Position */
#define DMA_CHLLCFGSTAT_DSA_Msk               (_UINT32_(0x1) << DMA_CHLLCFGSTAT_DSA_Pos)           /* (DMA_CHLLCFGSTAT) Destination Start Address Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_DSA(value)            (DMA_CHLLCFGSTAT_DSA_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_DSA_Pos)) /* Assigment of value for DSA in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_SSTRD_Pos             _UINT32_(4)                                          /* (DMA_CHLLCFGSTAT) Source Cell Stride Size Descriptor Load Position */
#define DMA_CHLLCFGSTAT_SSTRD_Msk             (_UINT32_(0x1) << DMA_CHLLCFGSTAT_SSTRD_Pos)         /* (DMA_CHLLCFGSTAT) Source Cell Stride Size Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_SSTRD(value)          (DMA_CHLLCFGSTAT_SSTRD_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_SSTRD_Pos)) /* Assigment of value for SSTRD in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_DSTRD_Pos             _UINT32_(5)                                          /* (DMA_CHLLCFGSTAT) Destination Cell Stride Size Descriptor Load Position */
#define DMA_CHLLCFGSTAT_DSTRD_Msk             (_UINT32_(0x1) << DMA_CHLLCFGSTAT_DSTRD_Pos)         /* (DMA_CHLLCFGSTAT) Destination Cell Stride Size Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_DSTRD(value)          (DMA_CHLLCFGSTAT_DSTRD_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_DSTRD_Pos)) /* Assigment of value for DSTRD in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_XSIZ_Pos              _UINT32_(6)                                          /* (DMA_CHLLCFGSTAT) Transfer Size Descriptor Load Position */
#define DMA_CHLLCFGSTAT_XSIZ_Msk              (_UINT32_(0x1) << DMA_CHLLCFGSTAT_XSIZ_Pos)          /* (DMA_CHLLCFGSTAT) Transfer Size Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_XSIZ(value)           (DMA_CHLLCFGSTAT_XSIZ_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_XSIZ_Pos)) /* Assigment of value for XSIZ in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_PDAT_Pos              _UINT32_(7)                                          /* (DMA_CHLLCFGSTAT) Match Pattern Descriptor Load Position */
#define DMA_CHLLCFGSTAT_PDAT_Msk              (_UINT32_(0x1) << DMA_CHLLCFGSTAT_PDAT_Pos)          /* (DMA_CHLLCFGSTAT) Match Pattern Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_PDAT(value)           (DMA_CHLLCFGSTAT_PDAT_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_PDAT_Pos)) /* Assigment of value for PDAT in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_CTRLCRC_Pos           _UINT32_(8)                                          /* (DMA_CHLLCFGSTAT) Control CRC Descriptor Load Position */
#define DMA_CHLLCFGSTAT_CTRLCRC_Msk           (_UINT32_(0x1) << DMA_CHLLCFGSTAT_CTRLCRC_Pos)       /* (DMA_CHLLCFGSTAT) Control CRC Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_CTRLCRC(value)        (DMA_CHLLCFGSTAT_CTRLCRC_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_CTRLCRC_Pos)) /* Assigment of value for CTRLCRC in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_CRCDAT_Pos            _UINT32_(9)                                          /* (DMA_CHLLCFGSTAT) CRC Data Descriptor Load Position */
#define DMA_CHLLCFGSTAT_CRCDAT_Msk            (_UINT32_(0x1) << DMA_CHLLCFGSTAT_CRCDAT_Pos)        /* (DMA_CHLLCFGSTAT) CRC Data Descriptor Load Mask */
#define DMA_CHLLCFGSTAT_CRCDAT(value)         (DMA_CHLLCFGSTAT_CRCDAT_Msk & (_UINT32_(value) << DMA_CHLLCFGSTAT_CRCDAT_Pos)) /* Assigment of value for CRCDAT in the DMA_CHLLCFGSTAT register */
#define DMA_CHLLCFGSTAT_Msk                   _UINT32_(0x000003FF)                                 /* (DMA_CHLLCFGSTAT) Register Mask  */


/* -------- DMA_CHSTATBC : (DMA Offset: 0x40) ( R/ 32) CHANNEL STATUS BLOCK COUNT REGISTER -------- */
#define DMA_CHSTATBC_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_CHSTATBC) CHANNEL STATUS BLOCK COUNT REGISTER  Reset Value */

#define DMA_CHSTATBC_BBTC_Pos                 _UINT32_(0)                                          /* (DMA_CHSTATBC) Bytes Transfered in the Block Counter Position */
#define DMA_CHSTATBC_BBTC_Msk                 (_UINT32_(0x1FFFF) << DMA_CHSTATBC_BBTC_Pos)         /* (DMA_CHSTATBC) Bytes Transfered in the Block Counter Mask */
#define DMA_CHSTATBC_BBTC(value)              (DMA_CHSTATBC_BBTC_Msk & (_UINT32_(value) << DMA_CHSTATBC_BBTC_Pos)) /* Assigment of value for BBTC in the DMA_CHSTATBC register */
#define DMA_CHSTATBC_Msk                      _UINT32_(0x0001FFFF)                                 /* (DMA_CHSTATBC) Register Mask  */


/* -------- DMA_CHSTATCC : (DMA Offset: 0x44) ( R/ 32) CHANNEL STATUS CELL COUNT REGISTER -------- */
#define DMA_CHSTATCC_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_CHSTATCC) CHANNEL STATUS CELL COUNT REGISTER  Reset Value */

#define DMA_CHSTATCC_CBTC_Pos                 _UINT32_(0)                                          /* (DMA_CHSTATCC) Bytes Transfered in the Cell Counter Position */
#define DMA_CHSTATCC_CBTC_Msk                 (_UINT32_(0x7FF) << DMA_CHSTATCC_CBTC_Pos)           /* (DMA_CHSTATCC) Bytes Transfered in the Cell Counter Mask */
#define DMA_CHSTATCC_CBTC(value)              (DMA_CHSTATCC_CBTC_Msk & (_UINT32_(value) << DMA_CHSTATCC_CBTC_Pos)) /* Assigment of value for CBTC in the DMA_CHSTATCC register */
#define DMA_CHSTATCC_Msk                      _UINT32_(0x000007FF)                                 /* (DMA_CHSTATCC) Register Mask  */


/* -------- DMA_CHSTAT : (DMA Offset: 0x48) ( R/ 32) CHANNEL STATUS REGISTER -------- */
#define DMA_CHSTAT_RESETVALUE                 _UINT32_(0x00)                                       /*  (DMA_CHSTAT) CHANNEL STATUS REGISTER  Reset Value */

#define DMA_CHSTAT_BLKBUSY_Pos                _UINT32_(0)                                          /* (DMA_CHSTAT) Channel Block Transfer Busy Status Bit (0: none; 1: busy) Position */
#define DMA_CHSTAT_BLKBUSY_Msk                (_UINT32_(0x1) << DMA_CHSTAT_BLKBUSY_Pos)            /* (DMA_CHSTAT) Channel Block Transfer Busy Status Bit (0: none; 1: busy) Mask */
#define DMA_CHSTAT_BLKBUSY(value)             (DMA_CHSTAT_BLKBUSY_Msk & (_UINT32_(value) << DMA_CHSTAT_BLKBUSY_Pos)) /* Assigment of value for BLKBUSY in the DMA_CHSTAT register */
#define DMA_CHSTAT_CELLBUSY_Pos               _UINT32_(1)                                          /* (DMA_CHSTAT) Channel Cell Transfer Busy Status Bit (0: none; 1: busy) Position */
#define DMA_CHSTAT_CELLBUSY_Msk               (_UINT32_(0x1) << DMA_CHSTAT_CELLBUSY_Pos)           /* (DMA_CHSTAT) Channel Cell Transfer Busy Status Bit (0: none; 1: busy) Mask */
#define DMA_CHSTAT_CELLBUSY(value)            (DMA_CHSTAT_CELLBUSY_Msk & (_UINT32_(value) << DMA_CHSTAT_CELLBUSY_Pos)) /* Assigment of value for CELLBUSY in the DMA_CHSTAT register */
#define DMA_CHSTAT_DREAD_Pos                  _UINT32_(2)                                          /* (DMA_CHSTAT) Descriptor Read Status Bit (0: not read or not avail, 1: read and loaded) Position */
#define DMA_CHSTAT_DREAD_Msk                  (_UINT32_(0x1) << DMA_CHSTAT_DREAD_Pos)              /* (DMA_CHSTAT) Descriptor Read Status Bit (0: not read or not avail, 1: read and loaded) Mask */
#define DMA_CHSTAT_DREAD(value)               (DMA_CHSTAT_DREAD_Msk & (_UINT32_(value) << DMA_CHSTAT_DREAD_Pos)) /* Assigment of value for DREAD in the DMA_CHSTAT register */
#define DMA_CHSTAT_Msk                        _UINT32_(0x00000007)                                 /* (DMA_CHSTAT) Register Mask  */


/* -------- DMA_CTRLA : (DMA Offset: 0x00) (R/W 32) DMA CONTROL A REGISTER -------- */
#define DMA_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (DMA_CTRLA) DMA CONTROL A REGISTER  Reset Value */

#define DMA_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (DMA_CTRLA) DMA Enable Position */
#define DMA_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << DMA_CTRLA_ENABLE_Pos)              /* (DMA_CTRLA) DMA Enable Mask */
#define DMA_CTRLA_ENABLE(value)               (DMA_CTRLA_ENABLE_Msk & (_UINT32_(value) << DMA_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the DMA_CTRLA register */
#define DMA_CTRLA_Msk                         _UINT32_(0x00000002)                                 /* (DMA_CTRLA) Register Mask  */


